Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོ་ག་དེའི་མིང་འཛིན་པ་ཙམ་གྱིས་སེམས་ཅན་ཡོངས་སུ་གྲོལ་བར་འགྱུར་ན། ལྟ་བ་དང་། ཀློག་པ་དང་། སྒྲུབ་པ་དང་། སྨྱུང་བའི་ཆོ་ག་བྱེད་པ་དང་། སྡོམ་པ་ལ་གནས་པ་ལྷ་སྨོས་ཀྱང་ཅི་དགོས།
en: If beings can be liberated by merely accepting it, how much more so if they look at it, read it, practice it, observe the ritual fast, and train in the procedure?

source: སེམས་ཅན་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Such beings will become irreversibly established on the path to perfect awakening.

source: །སེམས་ཅན་དག་པ་དུས་ལ་བབ་པ་གང་ཡིན་པར་ཤེས་ན་སྨྲོས་ཤིག །
en: Please teach, O pure being, this maṇḍala of liberation, if you think the time is right.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་ལྟ་ཞིང་བཞིན་འཛུམ་སྟེ། དོན་ཡོད་པ་རྣམ་པར་ལྟ་བའི་ཞགས་པའི་སྙིང་པོ་སྨྲས་སོ། །དུས་གསུམ་དུ་གཤེགས་ཤིང་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Noble Avalokiteśvara, the great bodhisattva being, looked up at the Blessed One’s face, smiled, and pronounced the heart mantra of Amoghavilokita­pāśa: “Homage to all the tathāgatas successively established throughout the three times!

source: །རང་སངས་རྒྱས་དང་འཕགས་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the pratyekabuddhas and the congregation of noble śrāvakas!

source: །འཕགས་པ་བྱམས་པ་ལ་སོགས་པ་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་མཆོག་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the eminent hosts of the great bodhisattvas headed by Maitreya!

source: །འཕགས་པ་རྡོ་རྗེ་འཆང་བའི་དཀྱིལ་འཁོར་གྱི་ལྷ་གཤིན་རྗེ་དང་།
en: Homage to the deities in the maṇḍala of Noble Vajradhara!

source: ཆུ་ལྷ་དང་། ལུས་ངན་པོ་དང་། དྲང་སྲོང་གི་ཚོགས་ཀྱི་མཆོག་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Yama, Varuṇa, Kubera, and the hosts of eminent ṛṣis!

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་ཐུགས་རྗེ་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ། །འདི་ལྟ་སྟེ། ཨོཾ་སརྦ་ཏ་ཐཱ་ག་ཏ། ཨ་བ་ལོ་ཀི་ཏེ་པ་ཤ་ཧྲྀ་ད་ཡེ། ཛྭ་ལ་ཛྭ་ལ།
en: Homage to Noble Avalokiteśvara, the great bodhisattva being with great compassion! [

source: དྷརྨ་དྷཱ་ཏུ་གརྦྷེ།
en: 199] “Oṁ, the heart essence of the noose gaze of all the tathāgatas, blaze, blaze!

source: ཙ་ར་ཙ་ར། མ་ཧཱ་པདྨ་པདྨ་བྷུ་ཛེ།
en: Born from the dharmadhātu, move, move!

source: དྷ་ར་དྷ་ར། མ་ཧཱ་བཱ་ཤ་དྷ་རེ། བ་ར་བ་ར་བ་ར་ད།
en: O great one with lotus arms, carry, carry!

source: རཤྨི་ཤ་ཏ་ས་ཧ་སྲ། པྲ་ཏི་མཎྜི་ཏ། ཤ་རཱི་རེ། ཏ་ར་ཏ་ར། བི་བུ་ལ་ཏེ་ཛ་དྷ་རེ།
en: O bearer of the great noose, hold captive, hold!

source: ཥཊ་པཱ་ར་མི་ཏཱ་པ་རི་པཱུ་ར་ཎི། ཀ་ལ་ཀ་ལ། མ་ཧ་བྲཧྨ།
en: You are endowed with the great fiery energy, bear, bear!

source: བེ་ཥ་དྷ་རེ། མ་ལ་མ་ལ། སརྦ་བཱ་བ་ཨཱ་བ་ར་ཎ་མ་ལ་ཀིལྦི་ཥ། ནཱ་ཤ་ནི། དྷུ་རུ་དྷུ་རུ། བོ་དྷི་ས་ཏྭ། པི་ཤུད་དྷེ་བྷུ་རུ་བྷུ་རུ།
en: You fulfill the six perfections, kala kala!

source: མ་ཧཱ་ས་ཏྭ། བད་ས་ལེ། ཡ་མ་བ་རུ་ཎི་ཀུ་བེ་ར་ནམ་སྐྲྀ་ཏེ། ཧུ་རུ་ཧུ་རུ་བྲཧྨ། བིཋྞུ།
en: O wearer of the great garb of Brahmā, mala mala!

source: མ་ཧེ་ཤྭ་ར། ཀུ་མཱ་ར། ནན་དི་ཀེ་ཤྭ་ར། ཨཱི་ཤྭར། མ་ཧེ་ཤྭ་ར་དེ་བ་པྲ་ཏྲ།
en: You remove all evil, obscurations, and nonvirtue, dhuru dhuru!

source: བདྡི་ཏ། བདྡི་ཏ། ན་མ་སྐྲྀ་ཏེ། བི་བི་དྷ་མ་ཎི་མཽ་ལི་དྷ་རེ།
en: O pure bodhisattva being, bhuru bhuru!

source: ཨ་མི་ཏཱ་བྷཱ་ཛི་ན། མ་ཀུ་ཊ།
en: O beloved great being!

source: དྷ་རེ། དི་བྱ། མ་ཎི་ཀ་ན་ཀ །བཛྲ་བཻ་ཌཱུརྱ།
en: You are revered by Yama, Varuṇa, and Kubera, huru huru!

source: མ་ར་ཀ་ཏ། པདྨ་རཱ་ག །ཨིནྡྲ་ནཱི་ལ་དི་བྱ་མུ་ཀ་ཏི་ཀ །ཨ་ལཾ་ཀྲྀ་ཏ། ཤ་རཱི་ར།
en: You are revered and adored by the gods Brahmā, Viṣṇu, Maheśvara, Kumāra, Nandikeśvara, Īśvara, and Maheśvara!

source: ཤྭེ་ཏ་ཡད་ཛྙོ་པ་བཱི་ཏ་དྷ་ར།
en: You wear various jewels in your diadem, which is crowned with the victorious Amitābha!

source: ཛ་ཊ་མ་ཀུ་ཊ།
en: Your body is adorned with divine jewels, gold, diamonds, beryls, emeralds, rubies, sapphires, and divine pearls!

source: མཎྜཱི་ཏ་ནཱ་མ།
en: You are invested with the white sacred thread!

source: ཙནྡྲ་རཱ་ཛི་ཏ།
en: Your topknot is adorned with a diadem and a new moon!

source: པདྨ་དྷ་ར། པདྨ་ཨཱ་ས་ན། པདྨ་བྷུ་ཛ། ཏྲི་ལོ་ཙ་ན།
en: You hold a lotus, sit on a lotus seat, and have lotus arms.

source: ཏྲི་ཤཱུ་ལ་དྷ་ར། བཱ་ཤ་དྷ་ར།
en: O three-eyed one with a trident and a noose!

source: སརྦ་ཏ་ཐཱ་ག་ཏ། ཨ་བྷི་ཥེ་ཀ་ཏ། ས་ར་ས་ར།
en: You are consecrated by all the tathāgatas, sara sara!

source: སརྦ་པཱ་པ་པྲ་ཤ་མ་ན་ཀ་ར།
en: You pacify all evil!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །ཏུ་རུ་ཏུ་རུ།
en: O most compassionate one, turu turu!

source: སརྦ་བ་ར་དཱ་ཡ་ཀ །
en: You grant every boon!

source: བོ་དྷི་བོ་དྷི། སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་བ་ལོ་ཀི་ཏེ། བོ་དྷི་མཎྜ།
en: O bodhi, bodhi!

source: ཨ་བ་ལོ་ཀི་ཏེ།
en: Yours is the gaze of all the tathāgatas, the gaze that is the essence of awakening!

source: མ་ཧེ་ཤྭ་ར། མ་ཧཱ་ཙིན་ཏཱ་མ་ཎི།
en: With a sweet expression on your face and great compassion, maintain your wakefulness, maintain!

source: དྷཱ་ར་བི་ཤྭ་རཱུ་པ། མ་ཧཱ་སཽ་མྱ་བ་ད་ན། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །
en: Awaken them, awaken!

source: བུད་དྷ་བུད་དྷ།
en: O Blessed Lord, you are the essence of all the tathāgatas’ enlightenment (āloka).

source: བྷ་ག་བཱན།
en: You bring the most excellent accomplishment!

source: ཨ་བ་ལོ་ཀི་ཏ་གརྦྷེ།
en: Loving care for all beings is your highest commitment!

source: མ་ཧཱ་པུཎྱ།
en: You release them from all suffering, O most compassionate one!

source: ཏེ་ཛ་དྷ་ར་པྲ་བར་སིད་དྷི་ཀ་ར་སརྦ་བྱཱ་དྷི་ཧ་ར།
en: Homage be to you, svāhā! “

source: སརྦ་སཏྭཱ་ཡ་བར་སརྦ་དུཿཁ། པྲ་མོ་ཙ་ཀ །མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ་ན་མོ་སྟུ་ཏེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་བདག་གི་འདི་ནི་རྨད་དུ་བྱུང་བ་རྣམ་པར་ལྟ་བའི་ཞགས་པའི་སྙིང་པོའོ། །དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའོ།
en: This dhāraṇī, O Blessed One, is my heart essence, the heart essence of the extraordinary noose-gaze, the heart essence of Amoghapāśa.

source: །རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་འཇིག་རྟེན་ལས་འདས་པའི་གཟུངས་ཀྱི་སྙིང་པོའོ།
en: This dhāraṇī is a maṇḍala of liberation; it is my heart dhāraṇī intended for supramundane purposes; it is the omnifarious great essence of Noble Avalokiteśvara.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོའོ། །གཟུགས་སྣ་ཚོགས་ཆེན་པོ་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་རྣམ་པར་འཕྲུལ་པ། ཕྱག་སྟོང་མངའ་བ། དབུ་སྟོང་མངའ་བ། སྤྱན་སྟོང་གིས་རྣམ་པར་གཟིགས་པ།
en: It is a magical transformation—one that has a thousand arms and a thousand heads and gazes with one thousand eyes—that is born of the illusion-like samādhi.

source: ཕྱག་བརྒྱ་སྟོང་གིས་བྱིན་གྱིས་བརླབས་པ། གང་གཱའི་ཀླུང་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བཅུའི་བྱེ་མའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་དང་མཉམ་པའི་དམ་ཚིག་གི་དཀྱིལ་འཁོར་དུ་རྗེས་སུ་ཞུགས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དེ་ཁོ་ན་ཉིད་གསང་བ་ལ་འཇུག་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞིང་དུ་འཇུག་པ།
en: It is empowered with one thousand mudrās, leads to hundreds of thousands of millions of billions of samaya maṇḍalas as numerous as the grains of sand in the Gaṅgā river, introduces the vidyā holder to the secret nature of all the tathāgatas, and lets him enter all buddha fields. “

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བགྲོད་པ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ། ཆོས་ཀྱི་སྒྲོན་མེ་འབར་བ།
en: This dhāraṇī causes the vidyā holder to attain the seat of awakening, turn the wheel of Dharma, and become a blazing torch of the Dharma.

source: བདུད་ལ་སོགས་པ་མ་རུངས་པ་ཐམས་ཅད་ཀྱི་བདུད་འཇོམས་པ། ཆོས་ཀྱི་དུང་འབུད་པ། ཆོས་ཀྱི་རྒྱལ་མཚན་སྒྲེང་བ། དམྱལ་བ་ཐམས་ཅད་སེལ་བ།
en: It will allow him to crush all māras and other such beings including the evil Māra himself, to blow the conch of Dharma, to raise the banner of Dharma, and to block rebirth in any of the hells.

source: ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་གྲུབ་པར་མཛད་པ།
en: It grants the accomplishment of all rites and is the ultimate cure for every disease.

source: ཆོ་ག་སྒྲུབ་པ་ཐམས་ཅད་ཀྱི་མཆོག་ས་བཅུ་ཆེན་པོ་ལ་སོ་སོར་འཇོག་པ། ཕྱིར་མི་ལྡོག་པའི་གནས་ལ་རྗེས་སུ་འཇུག་པ།
en: It is a great means for establishing beings on the ten bodhisattva levels, and it irreversibly establishes them on the path to awakening.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བ་དང་། བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ། དོན་ཡོད་པའི་མཆོག་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་མཛད་པ།
en: It is blessed and empowered by all the tathāgatas and amogha-produces supremely auspicious circumstances.

source: དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་བའི་རྣམ་པར་སྤྲུལ་པ། དོན་ཡོད་པར་སེམས་རྒྱ་མཚོ་སྙེད་ཡང་དག་པར་འཛིན་པ། དོན་ཡོད་པར་སེམས་ཅན་ས་བོན་ལ་སོ་སོར་འཇོག་པ། དོན་ཡོད་པར་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ།
en: It is a magical amogha transformation and a condensed ocean of amogha mind; it plants amogha seeds of goodness and causes the vidyā holder to partake in the amogha displays of the bodhisattvas. “

source: དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྒྲོགས་པ།
en: This dhāraṇī is a proclamation of miraculous amogha transformations of all the tathāgatas.

source: དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པ་དང་། བསྙེན་བཀུར་གྱི་སྤྲིན་རབ་ཏུ་བྱེད་པ།
en: It sends forth amogha clouds of offerings to all the tathāgatas and conjures up amogha acts of service.

source: དོན་ཡོད་པར་སེམས་ཅན་ཐམས་ཅད་མི་འཇིགས་པའི་ཁྱིམ་དུ་འཛུད་པ།
en: It causes all beings to enter the amogha city of fearlessness.

source: དོན་ཡོད་པར་སྦྱིན་པ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པ། དོན་ཡོད་པར་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: It fulfills the six perfections as a great amogha gift.

source: བ་དན་དང་། གོས་དང་། རྒྱན་དང་། ཆོས་གོས་སྣ་ཚོགས་དང་། རིན་པོ་ཆེ་བདུན་གྱི་ཆར་འབེབས་པ།
en: It brings the amogha rain of various divine flowers, incense, perfumes, garlands, scented oils and powders, monk’s robes, parasols, banners, flags, garments, adornments, ornaments, and the seven types of jewels.

source: དོན་ཡོད་པའི་ཚེ་ཡོངས་སུ་བརྗེས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ཏུ་བརྒྱན་པ་སྣ་ཚོགས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡང་དག་པར་ལྟ་བ།
en: It grants amogha rebirth in various beautifully adorned buddha fields, where the vidyā holder will see all the tathāgatas.

source: དོན་ཡོད་པར་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་རབ་ཏུ་རྫོགས་པ། དོན་ཡོད་པར་དགེ་བའི་རྩ་བ་ཆེན་པོ་སྐྱེད་པ། དོན་ཡོད་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡང་དག་པར་མཐོང་བ་དང་། གྲུབ་པ་དང་། ཆོ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་སྟོན་པ། དོན་ཡོད་པ
en: It produces a great accumulation of amogha merit and plants amogha roots of great virtue. “

source: ར་དབང་ཕྱུག་སྒྲུབ་པ། དོན་ཡོད་པར་རིག་སྔགས་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོ་ཡང་དག་པར་སྟོན་པ། དོན་ཡོད་པར་གྲུབ་པ་མཐོང་བ། དོན་ཡོད་པར་ཆོ་ག་མཐོང་བ། དོན་ཡོད་པར་ཚེ་རབ་ཏུ་འཕེལ་བ། དོན་ཡོད་པར་སྙན་པར་གྲགས་པ་རབ་ཏུ་སྟོན་པ། དོན་ཡོད་པར་འཁོར་བ་ལས་རབ་ཏུ་སྒྲོལ་བ། དོན་ཡོད་པར་སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བ་ལས་ཡོངས་སུ་སྒྲོལ་བ། དོན་ཡོད་པར་མཆོག་རབ་ཏུ་སྦྱིན་པ། དོན་ཡོད་པར་བཟླས་བརྗོད་དང་ཆོ་ག་རབ་ཏུ་རྫོགས་པ། དོན་ཡོད་པར་དྲན་པའི་དགེ་བའི་རྩ་བ་རབ་ཏུ་རྫོགས་པ།
en: This dhāraṇī facilitates an amogha appearance of all the tathāgatas and an amogha demonstration of their magical powers, manifestations, and displays; it grants lordly amogha power; it allows an amogha insight into the maṇḍalas of the vidyās, the collections of mudrās, and the rites; it shows amogha accomplishments and amogha treasure troves; it amogha-increases the lifespan; it brings amogha fame and renown; it amogha-rescues from saṃsāra and amogha-saves from birth, old age, and death; it grants amogha boons; it amogha-accomplishes mantra recitation procedures; it grants amogha powers of recollection and plants amogha roots of virtue. “

source: དོན་ཡོད་པར་རིག་འཛིན་འཁོར་ལོས་སྒྱུར་བ་ཐོབ་པ་ཡང་དག་པར་སྟོན་པ། དོན་ཡོད་པར་ལྷའི་གནས་དང་། གཞལ་མེད་ཁང་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་ལྷའི་གནས་སུ་འཇུག་བ། དོན་ཡོད་པར་འོག་མིན་གྱི་གནས་ཀྱི་བར་དུ་འཇུག་པ། དོན་ཡོད་པར་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་སུ་བརྒྱ་བྱིན་ལྷའི་རྒྱལ་པོར་འཇུག་པ།
en: This dhāraṇī is an amogha guide to becoming an emperor of vidyādharas; it secures an amogha entry to the palaces and celestial chariots of the devas, including the thirty-two palaces, and an amogha entry to the realm of Tuṣita, the abode of Akaniṣṭha, and the palaces in the realm of Thirty-Three, which are ruled by Śakra, the king of gods.

source: དོན་ཡོད་པར་རི་རབ་ཆེན་པོ་ལག་པ་གཅིག་གིས་སྒུལ་བ། དོན་ཡོད་པར་རྫུ་འཕྲུལ་གྱི་སྟོབས་སྟོན་པ། དོན་ཡོད་པར་མི་སྣང་བ་སྟོན་པ། དོན་ཡོད་པར་སྟོབས་འཕེལ་བ། དོན་ཡོད་པར་གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བ་སོ་སོར་འཐོབ་པ་སྟོན་པ།
en: This dhāraṇī allows the vidyā holder to amogha-move the great Mount Sumeru single-handedly; it exhibits magical amogha powers; it teaches how to become invisible; it causes the amogha power to grow; and it is an amogha guide to becoming an emperor who rules over the four continents. “

source: དོན་ཡོད་པར་ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོའི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་འབེབས་པ། དོན་ཡོད་པར་འབྲུའི་ཆར་འབེབས་པ། དོན་ཡོད་པར་གོས་ཀྱི་ཆར་འབེབས་པ། དོན་ཡོད་པར་རྒྱན་དང་། ཆོས་གོས་དང་། མུ་ཏིག་གི་ཆུན་འཕྱང་དང་། གདུབ་ཀོར་དང་། གསེར་གྱི་ཙོང་ཙོང་དང་། གདུ་བུ་དང་།
en: This dhāraṇī is a wish-fulfilling jewel that brings an amogha rain of various jewels, grain, and pieces of clothing.

source: དཔུང་རྒྱན་སྣ་ཚོགས་ཀྱི་ཆར་འབེབས་པ་ཡང་དག་པར་སྟོན་པ། དོན་ཡོད་པར་རོ་རྣམ་པ་སྣ་ཚོགས་རོའི་མཆོག་རོ་བརྒྱའི་ཁ་ཟས་ཀྱི་ཆར་འབེབས་པ། དོན་ཡོད་པར་སེམས་ཅན་སྣ་ཚོགས་གྲོལ་བ་སྟོན་པ། དོན་ཡོད་པར་བསྟན་བཅོས་དང་། ཚིག་ལེའུར་བྱས་པ་དང་། ཚུལ་དང་འདུལ་བ་དང་། མདོ་སྡེ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། དེ་ལྟ་བུ་བྱུང་བ་དང་། སྐྱེས་པའི་རབས་དང་།
en: It conjures up an amogha rain of adornments, jewelry, various gems, pearl necklaces, earrings, golden strings, bracelets, and armlets; it brings an amogha rain of the best foodstuffs of a hundred different flavors; it amogha-shows the way to completely liberate different types of beings; it grants amogha insight into various scientific treatises, aphorisms, works on polity, manuals on monastic rules, works on grammar, the epics, udāna literature,nidāna literature, stories of the past events, the jātakas, the vaipulya sūtras, the ‘marvels,’ Dharma instructions, the Abhidharma, and various narratives. “

source: ཤིན་ཏུ་རྒྱས་པ་དང་། རྨད་དུ་བྱུང་བའི་ཆོས་ཀྱི་མན་ངག་སྣ་ཚོགས་དང་། ཆོས་མངོན་པ་དང་། ཚོགས་ཀྱི་གཏམ་ཡང་དག་པར་སྟོན་པ་དང་། དོན་ཡོད་པར་ཐེག་པ་ཆེན་པོ་རྣམ་པ་སྣ་ཚོགས་རྒྱ་མཚོ་ལ་འཇུག་པ་དང་རབ་ཏུ་སྟོན་པ། དོན་ཡོད་པར་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་དང་། ཡི་དགས་དང་།
en: This dhāraṇī amogha-shows the depths of the great ocean of Mahāyāna in its diversity and causes the vidyā holder to submerge himself in it.

source: གྲུལ་བུམ་དང་། བརྗེད་བྱེད་དང་། བགེགས་དང་། ལོག་འདྲེན་སྣ་ཚོགས་ཉེས་པ་དང་། གསོད་པ་དང་ཤིན་ཏུ་སེལ་བ་ཡང་དག་པར་སྟོན་པ་ཡིན་ནོ།
en: It amogha-demonstrates the suppression, killing, and eradication of all wicked yakṣas, rākṣasas, bhūtas, piśācas, pretas, kumbhāṇḍas, apasmāras, vighnas, and vināyakas.

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་ན་ཡོན་ཏན་ཆེན་པོ་ཅན་གྱི་གཟུངས་ངན་སོང་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་བ།
en: In this way, O Blessed One, this dhāraṇī brings great benefits.

source: ཐམས་ཅད་དུ་མི་འཇིགས་པའི་གནས་རབ་ཏུ་སྟོན་པ། འཇིག་རྟེན་ལས་འདས་པའི་ལམ་ལེགས་པའི་ལམ་རབ་ཏུ་སྟོན་པ། མྱ་ངན་ལས་འདས་པའི་ལམ་རབ་ཏུ་སྟོན་པ། ཕྱིར་མི་ལྡོག་པའི་གནས་དང་། སངས་རྒྱས་ཉིད་སྦྱིན་པར་མཛད་པ་ལགས་ཏེ།
en: It pacifies all evil, shows one how to be fearless in every situation, shows the exalted, supramundane path, shows the path to nirvāṇa, irreversibly establishes beings on the path to awakening, and grants buddhahood.

source: བཅོམ་ལྡན་འདས་དོན་ཡོད་པར་རྣམ་པར་ལྟ་བའི་ཞགས་པའི་སྙིང་པོའི་གཟུངས་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་ཡོན་ཏན་ཁྱད་པར་ཡོངས་སུ་བསྒྲགས་པ།
en: This great dhāraṇī, O Blessed One, is the heart essence of Amoghāvalokita­pāśa.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་གསང་བ་ལ་རབ་ཏུ་གནས་པ་ལགས་སོ།
en: It is the heart essence of Noble Avalokiteśvara. It is praised for its special qualities and abides as the secret heart essence of all the tathāgatas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The blessed Tathāgata Śākyamuni said to Avalokiteśvara, the great bodhisattva being, “Good!

source: །སེམས་དཔའ་ཆེན་པོ་མཆོག་ཏུ་དཀོན་པའི་གཟུངས་འདིའི་སྙིང་པོ་འཇིག་རྟེན་ལས་འདས་པ་རྣམ་པར་འཕྲུལ་པ་བཤད་པ་དང་།
en: It is good, O great being, that you have taught this heart dhāraṇī that is so difficult to obtain.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་བ། གསང་བའི་སྙིང་པོ་ཡོངས་སུ་བསྒྲགས་པ་ལེགས་སོ་ལེགས་སོ།
en: This dhāraṇī is a magical display of the supramundane, praised as the secret essence of the qualities, powers, and miraculous transformations of all tathāgatas and bodhisattvas.

source: །དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ལམ་མཆོག་ཤིན་ཏུ་མཆོག་ཏུ་གྱུར་པ། གྱ་ནོམ་པ། བླ་མ། བླ་ན་མེད་པ།
en: This dhāraṇī is the supreme path to be followed by all beings.

source: མཆོག་ཏུ་དཀོན་པའི་གཟུངས་ཀྱི་སྙིང་པོ་གསང་བ་ཡོངས་སུ་བསྒྲགས་པ་སྟེ། གང་གི་འཁོར་བའི་རྒྱ་མཚོའི་ཆུ་བོ་ཆེན་པོ་དང་། སྲིད་པའི་རྒྱ་མཚོ་ལས་སེམས་ཅན་ཕ་རོལ་ཏུ་སྒྲོལ་བ་ཡིན་ནོ། །སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ཕའམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ཕའམ། དགེ་བསྙེན་མའམ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་།
en: It is famed as the secret heart-dhāraṇī, exceedingly difficult to obtain and supreme among the best, that any being can use to cross to the other shore of the great ocean of saṃsāra with its flood-like waters and leave the ocean of existence. “

source: དམངས་རིགས་གང་ལ་ལ་ཞིག་གམ། སེམས་ཅན་གཞན་གང་ཡང་རུང་བས་དོན་ཡོད་པར་རྣམ་པར་ལྟ་བའི་སྙིང་པོ་འདི་དང་། རྨད་དུ་བྱུང་བ་རྣམ་པར་ལྟ་བ་དོན་ཡོད་པའི་སྙིང་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རྨད་དུ་བྱུང་བའི་དེ་ཁོ་ན་ཉིད་རྣམ་པར་འཕྲུལ་པ། རྣམ་པར་སྣང་མཛད་ཀྱི་བྱིན་གྱིས་བརླབས་པ། དམ་ཚིག་ཆེན་པོ་དཀྱིལ་འཁོར་གྱི་མིང་འཛིན་པ་ཙམ་གྱིས་ཀྱང་དགེ་བའི་རྩ་བ་ཆེན་པོ་སོགས་པར་འགྱུར་རོ།
en: Any son or daughter who belongs to the family of Noble Avalokiteśvara, any monk or nun, any male or female lay practitioner, any ascetic brahmin, kṣatriya, vaiśya, or śūdra, or any other being will plant the roots of great merit merely by learning the name of this dhāraṇī, which is the heart essence of the amogha gaze, the heart essence of the wondrous amogha gaze, the maṇḍala of liberation of all the tathāgatas, a magical transformation of the extraordinary nature of all the tathāgatas, and the maṇḍala of the great samaya blessed by Vairocana.

source: །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དང་ལྡན་པར་ཡོངས་སུ་འཛིན་པར་ཡང་འགྱུར་རོ།
en: They will create and obtain a great amount of merit.

source: །གང་གཱའི་ཀླུང་འབུམ་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་དགུ་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མའི་རྡུལ་ཕྲ་རབ་དང་མཉམ་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་དུ་མཐོང་བ་དང་།
en: They will directly behold ninety-two times four hundred thousand million billion tathāgatas, tathāgatas equal in number to the grains of sand in the Gaṅgā river.

source: མངོན་དུ་ཆོས་ཐོས་པ་དང་།
en: They will hear their voices directly and will learn the Dharma directly from them.

source: མངོན་དུ་དབྱངས་ཐོས་པ་དང་།
en: They will also hear, directly from them, the prophecy of their own future awakening.

source: མངོན་དུ་ལུང་བསྟན་པ་ཐོས་པར་འགྱུར་བའི་སེམས་ཅན་ཆེན་པོ་དེ་དག་གིས་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཤིན་ཏུ་ཆེ་བ་དང་། དགེ་བའི་རྩ་བ་ཆེན་པོ་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །སེམས་ཅན་དེ་གཟུངས་གང་ཡིན་པ་དང་། དཀྱིལ་འཁོར་དང་། ཆོ་ག་དང་།
en: Such a great person will consequently obtain a great amount of merit and plant roots of great virtue. “

source: མིང་སྣ་ཚོགས་ད་ལྟར་ཐོས་པ་དང་། ཡང་ན་ཀློག་པ་དང་། ཡང་ན་ལྟ་བ་ཙམ་མཐོང་བ་ནི་དེ་དང་མཉམ་པ་ཡིན་ཏེ། རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོ་དེ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོའི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་འགྱུར་བ་ཡང་དེ་དང་མཉམ་པ་ཡིན་ན།
en: Any son or daughter of good family who merely hears the name of this dhāraṇī-maṇḍala rite, recites it, or sees it displayed will accumulate great merit and plants roots of great virtue.

source: དཀའ་བ་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: What would this merit be equivalent to in terms of difficult or rare achievements?

source: དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་ཉིད་དུ་ཐོས་པ་དང་མཐོང་བར་འགྱུར་རོ།
en: It would be the same as the achievement of seeing and listening to a tathāgata. “

source: །གང་དག་གཟུངས་འདིའི་དཀྱིལ་འཁོར་འབད་དེ་སྟོབས་དང་བརྩོན་འགྲུས་ཕ་རོལ་གནོན་པར་བྱེད་པ་དང་། ཚོལ་བ་དང་། འདྲི་བ་དང་།
en: And what if someone were to apply effort, strength, energy, and valor for the sake of this dhāraṇī-maṇḍala?

source: ཀློག་པ་དང་། བཟླས་བརྗོད་ཀྱི་ཆོ་ག་བྱེད་པ་དང་།
en: What if they wrote it, read it, or recited it according to procedure?

source: དཀྱིལ་འཁོར་གྱི་ཆོ་གས་སྒྲུབ་པར་བྱེད་པ་དང་། འབད་པར་བྱེད་པ་དེ་ནི་དཀའ་བ་ཆེན་པོ་ལ་ཞུགས་པ་ཡིན་ཏེ།
en: What if they practiced this maṇḍala as prescribed, made a genuine effort, and underwent great austerities for its sake?

source: དེ་དང་མཉམ་པ་ཡིན་ནོ། །དཀའ་བ་གང་ཞེ་ན།
en: What would their achievement be equivalent to?

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་དུ་དཀའ་བ་ལ་ཞུགས་པ་དང་། སངས་རྒྱས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་བར་ཡིན་ནོ། །རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ཕའམ།
en: It would be equivalent to the hardships undergone by the Tathāgata Śākyamuni, the worthy one, the fully realized Buddha, over the period of the three immeasurable eons it took him to attain buddhahood and then turn the wheel of Dharma. “

source: དགེ་སློང་མའམ། དགེ་བསྙེན་ཕའམ་དགེ་བསྙེན་མའམ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། རྒྱལ་རིགས་སམ། རྗེའུ་རིགས་དང་། དམངས་རིགས་གང་ཡིན་པའམ། སེམས་ཅན་གཞན་གང་ཡང་རུང་བས་གཟུངས་འདིའི་དཀྱིལ་འཁོར་དང་། ཆོ་ག་སྟོབས་ཆེན་པོ་དང་། ཕ་རོལ་གནོན་པའི་བརྩོན་འགྲུས་ཀྱིས་སྒྲུབ་པར་བྱེད་པ་འདི་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོ་ག་འཚོལ་བ་ཡིན་ནོ། །འདི་ལྟ་སྟེ། འདྲི་བ་དང་།
en: Any son or daughter of good family, any monk or nun, any male or female lay practitioner, any ascetic, brahmin, kṣatriya, vaiśya, or śūdra, or any other being who makes genuine effort and applies great strength, energy, and courage in performing the procedure of this dhāraṇī-maṇḍala is known to follow the supramundane method.

source: ཀློག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། བཟླས་བརྗོད་དང་། ཆོ་ག་དང་། དཀྱིལ་འཁོར་ལྟ་བ་དང་། འཇུག་པ་དང་། དམ་ཚིག་དང་། ཕྱག་རྒྱ་བཅིངས་ཏེ་སྒྲུབ་པ་དང་། འདི་ལྟ་སྟེ།
en: Such a person will make a pledge to write, read, study, recite according to procedure, and gaze at this maṇḍala.

source: ཐོས་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་།
en: They will take up the samaya, employ the mudrās, and listen to, uphold, propagate, study, deeply reflect on, and contemplate this dhāraṇī.

source: སེམས་པ་དང་། དུས་གསུམ་དུ་ལན་གསུམ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་དྲན་པ་དང་། ཁྲོ་བོའི་རྒྱལ་པོས་དབང་བསྐུར་བ་དང་། གཟུངས་འདི་ཡང་ལན་ཉི་ཤུ་རྩ་གཅིག་ཏུ་བཟླས་བརྗོད་དང་། ཆོ་ག་དྲན་པ་དང་།
en: They will, at the three junctions of the day, mentally repeat the heart mantra of Amoghapāśa, consecrate themselves with the mantra of Krodharāja, and mindfully repeat the dhāraṇī twenty-one times while following the recitation procedure.

source: བྱམས་པ་དང་། སྙིང་རྗེ་དང་། བྱམས་པས་སྙིང་བརླན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བ་ལྷུར་བྱེད་པ་དེ་ནི་དཀའ་བ་སྤྱོད་པ་ཆེན་པོ་ལ་ཞུགས་པ་ཡིན་ནོ།
en: Their heart will be filled with love and compassion, and they will be wholly motivated by feelings of pity for all sentient beings. “

source: །བསྐལ་པ་གྲངས་མེད་པ་གསུམ་དུ་དཀའ་བ་སྤྱོད་པ་ལ་ཞུགས་པ་དང་འདྲ་བའམ།
en: In acting like this, they will have performed great austerities that are not just equal to but actually exceed the austerities undergone by the Buddha over three immeasurable eons.

source: ལྷག་པ་ཡིན་ནོ། །དེའི་ཚེ་འདི་ཉིད་ལ་འབྲས་བུ་ཆེན་པོ་ཐོབ་པར་འགྱུར་བ་དང་། འཇིག་རྟེན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཉིད་དུ་སོ་སོར་གནས་པ་ཡིན་ནོ།། །།
en: They will obtain great supramundane results in their current birth and will become established in buddhahood.

source: འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་བཅུ་གསུམ་པ། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོའི་དགེ་བའི་རྩ་བ་བསགས་པར་འགྱུར་རོ།
en: They will plant the roots of virtue and accumulate a great amount of merit.

source: །རྟག་ཏུ་འཇིག་རྟེན་དབང་ཕྱུག་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །རྟག་ཏུ་ཕྱག་གཡས་པ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སྤྱི་བོ་ལ་འཇོག་པར་འགྱུར་རོ། །རྟག་ཏུ་མཆོག་སྦྱིན་པ་མཛད་པར་འགྱུར་རོ།
en: The Lokeśvara, to whom they will always remain close, is certain to place his right hand on their head and grant them boons.

source: །རྟག་ཏུ་ཞལ་མཐོང་བར་འགྱུར་རོ།
en: The Lokeśvara will always appear to them directly. “

source: །དེ་ལྟར་ན་ཡོན་ཏན་ཆེན་པོ་བརྗོད་པའི་གཟུངས་དང་། དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱ་དང་།
en: This procedure, the seal of the dhāraṇī-maṇḍala, is thus a source of great qualities.
